'use strict';

/**
 * Mapeia emojis de bandeiras para códigos de idioma compatíveis com DeepL.
 */
module.exports = {
  '🇸🇦': 'AR', '🇩🇪': 'DE', '🇵🇱': 'PL',
  '🇧🇬': 'BG', '🇬🇷': 'EL', '🇵🇹': 'PT-PT',
  '🇨🇳': 'ZH', '🇭🇺': 'HU', '🇷🇴': 'RO',
  '🇨🇿': 'CS', '🇮🇩': 'ID', '🇷🇺': 'RU',
  '🇩🇰': 'DA', '🇮🇹': 'IT', '🇸🇰': 'SK',
  '🇳🇱': 'NL', '🇯🇵': 'JA', '🇸🇮': 'SL',
  '🇺🇸': 'EN-US', '🇬🇧': 'EN-GB', '🇰🇷': 'KO', '🇪🇸': 'ES',
  '🇪🇪': 'ET', '🇱🇻': 'LV', '🇸🇪': 'SV',
  '🇫🇮': 'FI', '🇱🇹': 'LT', '🇹🇷': 'TR',
  '🇫🇷': 'FR', '🇳🇴': 'NB', '🇺🇦': 'UK',
  '🇧🇷': 'PT-BR'
};
