'use strict';

/**
 * Mapeia reações de bandeiras a códigos de idioma.
 */
module.exports = {
  '🇧🇷': 'PT-BR',
  '🇺🇸': 'EN',
  '🇫🇷': 'FR',
  '🇩🇪': 'DE',
  '🇪🇸': 'ES',
  '🇮🇹': 'IT',
  '🇷🇺': 'RU',
  '🇨🇳': 'ZH',
  '🇯🇵': 'JA',
  '🇰🇷': 'KO',
  '🇸🇦': 'AR',
  '🇵🇱': 'PL',
  '🇧🇬': 'BG',
  '🇬🇷': 'EL',
  '🇭🇺': 'HU',
  '🇷🇴': 'RO',
  '🇨🇿': 'CS',
  '🇮🇩': 'ID',
  '🇸🇰': 'SK',
  '🇸🇮': 'SL',
  '🇪🇪': 'ET',
  '🇱🇻': 'LV',
  '🇱🇹': 'LT',
  '🇫🇮': 'FI',
  '🇸🇪': 'SV',
  '🇳🇴': 'NB',
  '🇺🇦': 'UK',
  '🇩🇰': 'DA',
  '🇳🇱': 'NL',
  '🇹🇷': 'TR',
  '🇵🇹': 'PT',
};
