{
    "1006910950286299246": {
        "title": "Regras Gerais",
        "description": "1. **Seja respeitoso**\nㅤ<:emoji_98:1240127488156237925> Trate todos com respeito, independentemente de raça, gênero, religião, orientação sexual ou opiniões. Não toleramos discriminação, insultos ou assédio.\n\n\n2. **Linguagem apropriada**\nㅤ<:emoji_98:1240127488156237925> Use uma linguagem adequada, evitando palavrões ou conteúdo ofensivo. Mantenha um ambiente amigável sem causar desconforto a outros membros.\n\n\n3. **Conteúdo apropriado**\nㅤ<:emoji_98:1240127488156237925> Não compartilhe conteúdo pornográfico, violento, ilegal ou que infrinja direitos autorais. Mantenha as discussões relevantes e evite spam ou flood.\n\n\n4. **Privacidade e segurança**\nㅤ<:emoji_98:1240127488156237925> Respeite a privacidade dos membros e não compartilhe informações pessoais sem permissão. A segurança dos membros é uma prioridade.\n\n\n5. **Proibição de publicidade não autorizada**\nㅤ<:emoji_98:1240127488156237925> Não faça propaganda ou compartilhe links para outros servidores sem a aprovação dos administradores. Consulte a moderação antes de promover qualquer coisa.\n\n\n6. **Respeite as decisões da equipe**\nㅤ<:emoji_98:1240127488156237925> Siga as instruções dos moderadores e administradores. Se tiver dúvidas ou reclamações, entre em contato diretamente com a equipe.\n\n\n7. **Fique no tópico**\nㅤ<:emoji_98:1240127488156237925> Certifique-se de que suas mensagens estão relacionadas ao tema do canal.\n\n\n8. **Proibição de identificação enganosa**\nㅤ<:emoji_98:1240127488156237925> Não use apelidos idênticos aos de administradores, incluindo nomes de usuário ou qualquer identificação que possa causar confusão ou impessoalidade.\n\n\n<:seta2:1325132415542231140> Ei, você está quase lá! Verifique sua conta para desbloquear o acesso total ao servidor. Não deixe a galera esperando, hein!",
        "color": "#fe3838",
        "buttonEmoji": "<:emoji_34:1219815388921991259>",
        "buttonText": "Verificar",
        "roleId": "1267270735232110644",
        "channelId": "1018658580016152736",
        "messageId": "1333571174680105072"
    },
    "1148661284594790400": {
        "title": "Verificação Necessária",
        "description": "Clique no botão abaixo para se verificar e obter acesso ao servidor.",
        "color": "#fe3838",
        "buttonText": "Verificar",
        "buttonEmoji": "<:emoji_34:1219815388921991259>",
        "roleId": null,
        "channelId": null,
        "messageId": "1333583478436008017"
    }
}